// ---------------------------------------------------------------------------------
/// 3Dモデルの読み込みを行うクラス
/// JSONによる独自形式のみに対応
// ---------------------------------------------------------------------------------

class ModelLoader {

	// ------------------------------------------------------
	/// JSONで記述された3Dモデルを読み込む
	/// [param] url モデルのURL
	// ------------------------------------------------------
	static loadModel(url) {
		var xmlHttp = new XMLHttpRequest();

		xmlHttp.open("GET", url, false);
		xmlHttp.send(null);
		return (xmlHttp.status === 200) ? eval("(" + xmlHttp.responseText + ")") : null;
	}
}
